Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetReportProperty Method (String, Double)
 Retrieves a double property of the report for the model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetReportProperty(
	string name,
	ref double value
)
Public Function GetReportProperty (
	name As String,
	ByRef value As Double
) As Boolean
Parameters
name
Type: System.String
The name of the property to be retrieved.
value
Type: System.Double
The return value.
Return Value
Type: Boolean
True if the value was returned successfully.
See Also
Reference
ModelObject Class
GetReportProperty Overload
Tekla.Structures.Model Namespace